[
  {
    "_id" : "00001",
    "title" : "Classic British Scones",
    "source" : "Mischa Lewis-Norelle",
    "ingredients" : [
      "285 g (2 cups) flour",
      "40 g (3 tbsp) sugar",
      "1 tbsp baking powder",
      "½ tsp salt",
      "70 g (5 tbsp) cold unsalted butter",
      "120 g (1 cup) heavy cream (or buttermilk or coconut milk)"
    ],
    "instructions" : "Preheat oven to 425˚F. <br><br>Combine dry ingredients and butter with food processor or fingertips until mixture resembles coarse sand. Stir in any mix-ins. Then put the mixture in the freezer for 15 minutes, or overnight for easy scones tomorrow morning.<br><br>Stir in cream until a dough begins to form. Then transfer to a floured work surface and knead together until the dough just comes together in a rough, slightly sticky ball. Gently pat dough into a ¾-inch-think circle, and cut into 8 wedges. Bake until tops are light brown, 12-15 minutes. Let cool on rack for 10 minutes before serving with butter (or clotted cream if available) and jam.<br><br><b>Variations:</b><br><i>Jalapeno Cheddar:</i> omit sugar. Add only 3 tbsp butter along with 4 oz sharp cheddar cheese. Add ½ cup jalapenos.<br><i>Cranberry Orange:</i> add ½ cup cranberries, the zest of an orange, and 2 tbsp orange liqueur.<br><i>Ginger, Lemon, Mint:</i> add ½ cup crystallized ginger, the zest of a lemon, 2 tbsp lemon juice or extract, and ¼ cup chopped mint."
  },
  {
    "_id" : "00002",
    "title" : "Pasta Aglio e Olio",
    "source" : "Babish",
    "ingredients" : [
      "½ head garlic, separated and peeled ",
      "1 bunch parsley, rinsed",
      "½ cup good quality olive oil",
      "1 tsp red pepper flakes",
      "½ lb dry linguine ½ lemon"
    ],
    "instructions" : "Heavily salt a large pot of water, and bring to a boil. Cook pasta to al dente while completing the steps below. <br><br>Slice the garlic cloves thinly, and set aside. Pick the parsley leaves from their stems, and finely chop. Add olive oil to a large sauté pan, and heat over medium flame until shimmering. Add sliced garlic, stirring constantly, until garlic is barely toasted. Add the red pepper flake and remove from heat. <br><br>Add the pasta, drained, with about ¼ cup reserved pasta cooking water. Add lemon juice and parsley, and toss to combine. Season for salt and pepper, and serve."
  }
]