[
  {
    "title": "Pizza Dough",
    "source": "Kush Patel",
    "genre": "breads",
    "ingredients": [
      "3.5 cups flour",
      "1.5 cups lukewarm water ",
      "2 tbsp olive oil",
      "7 g yeast",
      "1.5 tbsp salt"
    ],
    "instructions": "Activate yeast by dissolving into water and waiting about 5 minutes until bubbles form. In another bowl, mix the flour and salt together. Add olive oil and water, and mix in bowl until ingredients are thoroughly combined. Then turn out the dough onto a floured work surface and knead vigorously for about 10 minutes, until the dough is stretchy, smooth, and much less sticky. Then roll into a ball, place in lightly oiled bowl, turning once to coat in oil, and proof under cling film for at least an hour, or up to 24.\r\n\r\nTurn out the dough onto a floured work surface, kneading slightly to recombine if it has gotten uneven. Split into two and roll each half into a ball. Dust with flour and proof under a clean tea towel for another hour.\r\n\r\nStart to flatten the pizza dough by poking it all over with your fingers. Use this technique to coax the dough gently into the desired shape. You can also let it hang off the side of the counter, or throw it with a spin using your knuckles. Add toppings and bake at 500 ̊F for 12-15 minutes."
  },
  {
    "title": "Pasta Aglio e Olio",
    "source": "Binging with Babish",
    "genre": "noodles",
    "ingredients": [
      "½ head garlic, separated and peeled ",
      "1 bunch parsley, rinsed ",
      "½ cup good quality olive oil ",
      "1 tsp red pepper flakes ",
      "½ lb dry linguine ",
      "½ lemon"
    ],
    "instructions": "Heavily salt a large pot of water, and bring to a boil. Cook pasta to al dente while completing the steps below. \r\n\r\nSlice the garlic cloves thinly, and set aside. Pick the parsley leaves from their stems, and finely chop. Add olive oil to a large sauté pan, and heat over medium flame until shimmering. Add sliced garlic, stirring constantly, until garlic is barely toasted. Add the red pepper flake and remove from heat. \r\n\r\nAdd the pasta, drained, with about ¼ cup reserved pasta cooking water. Add lemon juice and parsley, and toss to combine. Season for salt and pepper, and serve.\r\n"
  },
  {
    "title": "Chile Rellenos",
    "source": "Kush and Devin",
    "genre": "cooked veg",
    "ingredients": [
      "6 poblano or pasilla chiles",
      "1 package queso fresco",
      "2 eggs, separated",
      "flour",
      "3 serrano chiles (optional)"
    ],
    "instructions": "Using the broiler or an open flame, char the outsides of the poblano chiles until they are blackened and bubbly. Once they are blackened all the way around, set the chiles in a plastic bag for 15 minutes to sweat and cool.\r\n\r\nWhile still warm, carefully remove the chiles one by one from the bag. Using your hands, peel off the blackened skin (you can leave a bit). Make a small vertical slit in each chile. Pull out the seeds from the top (leaving in a few is fine). This is hard to do without splitting the chile open too much, so take care. Stuff each chile with chopped-up queso fresco and, optionally, diced serrano chiles. Close along the seam using toothpicks or skewers.\r\n\r\nPrepare a deep pan with 1-2 inches of vegetable oil on medium heat. Prep a bowl of flour, and another bowl with two egg whites, making sure to save the yolks. Beat the egg whites vigorously until the form stiff peaks, several minutes. At the end, add the yolk back in and beat until just combined.\r\n\r\nOne by one, coat each stuffed chile in flour, then egg batter, and then fry on both sides."
  },
  {
    "title": "Five-Peppercorn Fish",
    "source": "David Tanis, NY Times, via Pat O'Brien",
    "genre": "seafood",
    "ingredients": [
      "⅗ tsp black Tellicherry peppercorns",
      "⅗ tsp green peppercorns",
      "⅗ tsp pink peppercorns",
      "⅗ tsp Sichuan peppercorns",
      "⅗ tsp Timut peppercorns",
      "4 tbsp unsalted butter",
      "12 fresh sage leaves",
      "",
      "4 boneless halibut, sea bass or  grouper fillets, about 6 oz. each",
      "pinch of salt",
      "flour, for dusting",
      "2 tablespoons olive oil",
      "",
      "½ teaspoon lemon or lime zest",
      "1 tablespoon lemon or lime juice"
    ],
    "instructions": "Toast peppercorns in pan until fragrant for a minute or two. Then grind together with mortar and pestle to coarse powder.\r\n\r\nMelt butter in small saucepan over medium-high heat. Add peppercorn mixture and swirl pan until butter foams and begins to brown. Add sage leaves and pinch of salt. Cook for a few minutes to get the leaves crispy. Then set aside, off heat.\r\n\r\nSeason fish fillets on both sides with salt and lightly dust with flour. Heat oil in a wide skillet over medium heat. Brown fillets on both sides gently, about 5 minutes each side. \r\n\r\nReturn butter sauce to stove over medium-high heat and bring to a simmer. Add citrus zest and juice. Stir will, then spoon over fish and serve immediately."
  },
  {
    "title": "Shepherd’s Pie",
    "source": "Peter Boyd",
    "genre": "meat",
    "ingredients": [
      "2 tbsp olive oil",
      "2 lbs ground lamb",
      "4 tbsp soy sauce",
      "4 tbsp worchester sauce",
      "1 large onion finely chopped",
      "1 tsp Hoisin sauce",
      "1 tsp garlic chili paste",
      "peas and carrots (optional)",
      "3 oz tomato paste",
      "1 tbsp garam marsala",
      "2 tbsp oregano",
      "parmesan",
      "potatoes ",
      "butter",
      "cream (optional)"
    ],
    "instructions": "Preheat oven to 350°.\r\n\r\nFry meat in olive oil until brown. Add soy and worcester sauce. Add onions, Hoisin sauce, garlic chili paste. Optionally, add in peas and carrots. When onions are fully cooked, add tomato paste. Mix well, turn off heat. Finally, stir in garam marsala.\r\n\r\nBoil potatoes until soft. Then blend until very smooth with a generous pad of butter and cream.\r\n\r\nCover bottom of pan with oregano. Spoon in meat. Then spoon in mashed potatoes. Spread out and rake with fork into decorative pattern. Grate parmesan on top, then spray or brush top generously with olive oil. Bake for 30 mins. Then brown under the grill. Watch carefully, as it will brown very quickly!"
  },
  {
    "title": "Grilled Tempeh & Arugula Salad",
    "source": "Kush Patel",
    "genre": "raw veg",
    "ingredients": [
      "1 lb baby arugula",
      "6 oz tempeh",
      "cherry tomatoes",
      "crumbly blue cheese",
      "glazed pecans (see Nuts section)",
      "dried cranberries",
      "soy sauce",
      "olive oil",
      "balsamic vinegar",
      "salt ",
      "pepper"
    ],
    "instructions": "Slice tempeh thinly and sautée in olive oil. Pour a bit of soy sauce over the tempeh while cooking, and cook both sides until browned.\r\n\r\nCombine arugula, tempeh, tomatoes (sliced in half), pecans, cranberries, and cheese crumbles in a large salad bowl. Dress with 50/50 mix of oil and vinegar and add salt and pepper to taste."
  },
  {
    "title": "Cranberry Sauce",
    "source": "Joy of Cooking",
    "genre": "sauces",
    "ingredients": [
      "1 lb cranberries",
      "1¼ cups sugar",
      "½ cup water",
      "½ cup orange juice",
      "2 tsp grated orange zest (about 1 orange) "
    ],
    "instructions": "Cook, uncovered until the cranberries pop open and the mixture is thickened, about 7-15 minutes.\r\n\r\nLet cool and serve warm, or refrigerate and enjoy cold."
  },
  {
    "title": "Classic British Scones",
    "source": "Mischa Lewis-Norelle",
    "genre": "breakfast",
    "ingredients": [
      "285 g (2 cups) flour",
      "40 g (3 tbsp) sugar",
      "1 tbsp baking powder",
      "½ tsp salt",
      "70 g (5 tbsp) cold unsalted butter",
      "120 g (1 cup) heavy cream (or buttermilk or coconut milk)",
      "½ cup dried currants or cranberries (optional)"
    ],
    "instructions": "Preheat oven to 425˚F. \r\n\r\nCombine dry ingredients and butter with food processor or fingertips until mixture resembles coarse sand. Stir in any mix-ins. Then put the mixture in the freezer for 15 minutes, or overnight for easy scones tomorrow morning.\r\n\r\nStir in cream until a dough begins to form. Then transfer to a floured work surface and knead together until the dough just comes together in a rough, slightly sticky ball. Gently pat dough into a ¾-inch-think circle, and cut into 8 wedges. Bake until tops are light brown, 12-15 minutes. Let cool on rack for 10 minutes before serving with butter (or clotted cream if available) and jam.\r\n\r\nVariations:\r\nJalapeno Cheddar: omit sugar. Add only 3 tbsp butter along with 4 oz sharp cheddar cheese. Add ½ cup jalapenos.\r\nCranberry Orange: add ½ cup cranberries, the zest of an orange, and 2 tbsp orange liqueur\r\nGinger, Lemon, Mint: add ½ cup crystallized ginger, the zest of a lemon, 2 tbsp lemon juice or extract, ¼ cup chopped mint"
  },
  
  {
    "title": "Lava Cakes of Love",
    "source": "Matty Matheson",
    "genre": "sweets",
    "ingredients": [
      "115g (¼ lb) butter",
      "115g (4 oz) semisweet baking chocolate",
      "2 eggs",
      "3 egg yolks",
      "1 tsp vanilla",
      "60g icing sugar (granulated also works)",
      "40g flour",
      "1 tbsp espresso powder (optional)",
      "sea salt"
    ],
    "instructions": "Preheat oven to 425˚ F. Grease four ramekins or porcelain mugs with butter.\r\n\r\nOver a double boiler, melt and combine butter and chocolate. Remove from heat and incorporate eggs and yolks quickly. Then stir in vanilla, sugar, and flour, and, optionally, espresso powder (for added flavor).\r\n\r\nFill ramekins equally and sprinkle top with sea salt. Bake for 12 minutes. Let cool serve with whipped cream and raspberries."
  }
]