[

    {
        "id": {
            "$oid": "5d19ee53ca1fb51642c46453"
        },
        "title": "Pizza Dough",
        "source": "Kush Patel",
        "genre": "baked",
        "ingredients": [
            "3.5 cups flour",
            "1.5 cups lukewarm water ",
            "2 tbsp olive oil",
            "7 g yeast",
            "1.5 tbsp salt"
        ],
        "instructions": "Activate yeast by dissolving into water and waiting about 5 minutes until bubbles form. In another bowl, mix the flour and salt together. Add olive oil and water, and mix in bowl until ingredients are thoroughly combined. Then turn out the dough onto a floured work surface and knead vigorously for about 10 minutes, until the dough is stretchy, smooth, and much less sticky. Then roll into a ball, place in lightly oiled bowl, turning once to coat in oil, and proof under cling film for at least an hour, or up to 24.\r\n\r\nTurn out the dough onto a floured work surface, kneading slightly to recombine if it has gotten uneven. Split into two and roll each half into a ball. Dust with flour and proof under a clean tea towel for another hour.\r\n\r\nStart to flatten the pizza dough by poking it all over with your fingers. Use this technique to coax the dough gently into the desired shape. You can also let it hang off the side of the counter, or throw it with a spin using your knuckles. Add toppings and bake at 500 ̊F for 12-15 minutes.",
        "created_at": "2019-07-01T11:28:19.288Z",
        "updated_at": "2019-07-04T16:00:06.432Z",
        "url": "http://localhost:3000/recipes/5d19ee53ca1fb51642c46453.json"
    },
    {
        "id": {
            "$oid": "5d1e27110765e00c41a47e09"
        },
        "title": "Pasta Aglio e Olio",
        "source": "Binging with Babish",
        "genre": "veggie",
        "ingredients": [
            "½ head garlic, separated and peeled ",
            "1 bunch parsley, rinsed ",
            "½ cup good quality olive oil ",
            "1 tsp red pepper flakes ",
            "½ lb dry linguine ",
            "½ lemon"
        ],
        "instructions": "Heavily salt a large pot of water, and bring to a boil. Cook pasta to al dente while completing the steps below. \r\n\r\nSlice the garlic cloves thinly, and set aside. Pick the parsley leaves from their stems, and finely chop. Add olive oil to a large sauté pan, and heat over medium flame until shimmering. Add sliced garlic, stirring constantly, until garlic is barely toasted. Add the red pepper flake and remove from heat. \r\n\r\nAdd the pasta, drained, with about ¼ cup reserved pasta cooking water. Add lemon juice and parsley, and toss to combine. Season for salt and pepper, and serve.\r\n",
        "created_at": "2019-07-04T16:19:29.203Z",
        "updated_at": "2019-07-04T16:19:29.203Z",
        "url": "http://localhost:3000/recipes/5d1e27110765e00c41a47e09.json"
    },
    {
        "id": {
            "$oid": "5d1e275b0765e00c41a47e0a"
        },
        "title": "Vegan Mac n’ Cheese",
        "source": "Kush",
        "genre": "veggie",
        "ingredients": [
            "2 medium potatoes",
            "¼ large onion",
            "1 carrot",
            "½ cup nutritional yeast",
            "½ cup cashews",
            "1 lb macaroni pasta",
            "turmeric",
            "paprika",
            "chili powder",
            "granulated garlic",
            "oregano",
            "thyme",
            "salt",
            "fresh ground black pepper",
            "(optional) XXX hot sauce"
        ],
        "instructions": "Chop onions and carrots into 2-3 pieces each. Bring a pot of water to boil and throw the veggies in. Boil until potatoes are soft - poke with a fork to check.\r\n\r\nTransfer vegetables into a blender jar. Set aside 1 cup of the water. Then salt the still-boiling rest of the water and add pasta.\r\n\r\nWhile pasta cooks, add cashews and nooch to blender with a bit of the water. Blend until smooth and creamy, adding water until desired consistency is reached. Add spices to taste. Add optional hot sauce for a kick!\r\n\r\nWhen pasta is al dente, drain water off and add to a bowl. Pour the sauce over, mix well, and serve immediately! Garnish with italian parsley, fresh ground black pepper, and parmesan if you aren’t actually vegan.",
        "created_at": "2019-07-04T16:20:43.347Z",
        "updated_at": "2019-07-04T16:20:43.347Z",
        "url": "http://localhost:3000/recipes/5d1e275b0765e00c41a47e0a.json"
    },
    {
        "id": {
            "$oid": "5d1e27800765e00c41a47e0b"
        },
        "title": "Saag Paneer",
        "source": "Farhana Sahibzada",
        "genre": "veggie",
        "ingredients": [
            "¼ cup ghee or any cooking oil",
            "2” ginger, finely chopped or grated",
            "1 bunch green onions, chopped",
            "¼ cup chopped cilantro",
            "2-4 serrano chiles, chopped",
            "1½ medium yellow onion",
            "3-4 cloves garlic, finely chopped",
            "3-4 cloves garlic, smashed",
            "32 oz. chopped frozen spinach",
            "pinch of salt",
            "½ tsp cayenne pepper",
            "½ tsp crushed red pepper",
            "½ tsp cumin",
            "1 tsp coriander powder",
            "½ cup cream or smooth yogurt",
            "14 oz paneer, cubed"
        ],
        "instructions": "Start a pot of water boiling. Heat ghee or oil in a large saucepan. Add onions, green onions, cilantro, chiles, ginger, and chopped garlic. Stir often and sauté for about 10 minutes.\r\n\r\nWhile sautéing curry base, boil the spinach with smashed garlic and a pinch of salt for 5-7 minutes and drain.\r\n\r\nAdd dry spices to curry base and cook another 3-5 minutes. Then add cream or yogurt and stir together until smooth. Add spinach mixture and cover. Simmer on low-medium heat for 20 minutes.\u000b\u000bTransfer ⅓-¼ of the spinach mixture (depending on desired consistency) to a blender and blend until smooth with a little added water. Then stir back in. Reduce heat and simmer, covered, on low for another 15 minutes.\r\n\r\nMeanwhile, fry cubes of paneer in oil until they are crispy on all sides. When the spinach is done, stir in paneer and serve with rice and naan.",
        "created_at": "2019-07-04T16:21:20.966Z",
        "updated_at": "2019-07-04T16:21:20.966Z",
        "url": "http://localhost:3000/recipes/5d1e27800765e00c41a47e0b.json"
    },
    {
        "id": {
            "$oid": "5d1e27a50765e00c41a47e0c"
        },
        "title": "Chile Rellenos",
        "source": "Kush and Devin",
        "genre": "veggie",
        "ingredients": [
            "6 poblano or pasilla chiles",
            "1 package queso fresco",
            "2 eggs, separated",
            "flour",
            "3 serrano chiles (optional)"
        ],
        "instructions": "Using the broiler or an open flame, char the outsides of the poblano chiles until they are blackened and bubbly. Once they are blackened all the way around, set the chiles in a plastic bag for 15 minutes to sweat and cool.\r\n\r\nWhile still warm, carefully remove the chiles one by one from the bag. Using your hands, peel off the blackened skin (you can leave a bit). Make a small vertical slit in each chile. Pull out the seeds from the top (leaving in a few is fine). This is hard to do without splitting the chile open too much, so take care. Stuff each chile with chopped-up queso fresco and, optionally, diced serrano chiles. Close along the seam using toothpicks or skewers.\r\n\r\nPrepare a deep pan with 1-2 inches of vegetable oil on medium heat. Prep a bowl of flour, and another bowl with two egg whites, making sure to save the yolks. Beat the egg whites vigorously until the form stiff peaks, several minutes. At the end, add the yolk back in and beat until just combined.\r\n\r\nOne by one, coat each stuffed chile in flour, then egg batter, and then fry on both sides.",
        "created_at": "2019-07-04T16:21:57.336Z",
        "updated_at": "2019-07-04T16:21:57.336Z",
        "url": "http://localhost:3000/recipes/5d1e27a50765e00c41a47e0c.json"
    },
    {
        "id": {
            "$oid": "5d1e27c00765e00c41a47e0d"
        },
        "title": "Cauliflower Soup",
        "source": "Chris Reed",
        "genre": "veggie",
        "ingredients": [
            "1 tablespoon olive oil",
            "1 medium-small onion, chopped",
            "1 clove garlic, minced",
            "1 large cauliflower cut into florets 2 small florets for garnish",
            "3 12-oz cans (6 cups) chicken broth or vegetable stock",
            "3 sprigs fresh thyme",
            "1 bay leaf",
            "salt and pepper",
            "red grapes, diced",
            "dill",
            "chives"
        ],
        "instructions": "In a large pot over medium heat, brown the onions in olive oil. When most of the moisture is cooked out, add garlic and cook a few seconds until fragrant. \r\n\r\nAdd stock, cauliflower, thyme, and bay leaf. Bring to boil and simmer 20 mins.\r\n\r\nRemove and discard thyme and bay leaf. Blend finely with immersion blender or transfer to regular blender. Stir in salt and pepper to taste and reheat if necessary.\r\n\r\nGarnish with finely-slivered raw cauliflower, diced grapes, a tad of dill, a few small\r\nspikes of chives and a dab of olive oil. Serve in warmed thick-walled bowls.",
        "created_at": "2019-07-04T16:22:24.720Z",
        "updated_at": "2019-07-04T16:22:24.720Z",
        "url": "http://localhost:3000/recipes/5d1e27c00765e00c41a47e0d.json"
    },
    {
        "id": {
            "$oid": "5d1e27fb0765e00c41a47e0e"
        },
        "title": "Five-Peppercorn Fish",
        "source": "David Tanis, NY Times, via Pat O'Brien",
        "genre": "seafood",
        "ingredients": [
            "⅗ tsp black Tellicherry peppercorns",
            "⅗ tsp green peppercorns",
            "⅗ tsp pink peppercorns",
            "⅗ tsp Sichuan peppercorns",
            "⅗ tsp Timut peppercorns",
            "4 tbsp unsalted butter",
            "12 fresh sage leaves",
            "",
            "4 boneless halibut, sea bass or  grouper fillets, about 6 oz. each",
            "pinch of salt",
            "flour, for dusting",
            "2 tablespoons olive oil",
            "",
            "½ teaspoon lemon or lime zest",
            "1 tablespoon lemon or lime juice"
        ],
        "instructions": "Toast peppercorns in pan until fragrant for a minute or two. Then grind together with mortar and pestle to coarse powder.\r\n\r\nMelt butter in small saucepan over medium-high heat. Add peppercorn mixture and swirl pan until butter foams and begins to brown. Add sage leaves and pinch of salt. Cook for a few minutes to get the leaves crispy. Then set aside, off heat.\r\n\r\nSeason fish fillets on both sides with salt and lightly dust with flour. Heat oil in a wide skillet over medium heat. Brown fillets on both sides gently, about 5 minutes each side. \r\n\r\nReturn butter sauce to stove over medium-high heat and bring to a simmer. Add citrus zest and juice. Stir will, then spoon over fish and serve immediately.",
        "created_at": "2019-07-04T16:23:23.187Z",
        "updated_at": "2019-07-04T16:23:23.187Z",
        "url": "http://localhost:3000/recipes/5d1e27fb0765e00c41a47e0e.json"
    },
    {
        "id": {
            "$oid": "5d1e281f0765e00c41a47e0f"
        },
        "title": "Breadcrumb White Fish",
        "source": "Chris Reed",
        "genre": "seafood",
        "ingredients": [
            "white fish fillets",
            "butter",
            "flour",
            "breadcrumbs",
            "parmesan (processed)",
            "dried thyme"
        ],
        "instructions": "Make 3 bowls, one with flour, one with butter, one with 30% parmesan, 70% breadcrumbs mixture plus a generous dose of thyme. Dip the fish fillets first in flour, then butter, then breadcrumb mixture.\r\n\r\nBake at 470 deg F for about 25 mins, until done. Serve with tortellini and a vegetable.",
        "created_at": "2019-07-04T16:23:59.929Z",
        "updated_at": "2019-07-04T16:23:59.929Z",
        "url": "http://localhost:3000/recipes/5d1e281f0765e00c41a47e0f.json"
    },
    {
        "id": {
            "$oid": "5d1e28500765e00c41a47e10"
        },
        "title": "One-Pan Salmon, Asparagus, and Potato",
        "source": "Basics with Babish",
        "genre": "seafood",
        "ingredients": [
            "salmon fillet",
            "potatoes",
            "asparagus",
            "olive oil",
            "kosher salt",
            "fresh ground pepper",
            "",
            "dijon mustard",
            "one lemon",
            "dill "
        ],
        "instructions": "Preheat oven to 200˚ C / 400˚ F with a baking sheet inside.\r\n\r\nCut the potatoes into halves, quarters, or eighths depending on size. Toss in oil, salt, and pepper. When the oven is ready, place on the baking pan and roast for 20 minutes.\r\n\r\nMeanwhile, make a vinaigrette: combine the juice of one lemon, a similar amount of mustard and olive oil, salt, pepper, and dill to taste. Spread the vinaigrette on the salmon, saving some aside if desired for serving.\r\n\r\nCut the bottoms off the asparagus and toss in olive oil, salt, and pepper.\r\n\r\nAfter the initial 20 minutes, remove the pan and place the asparagus and salmon on it. Put it back in for 15 minutes and check on the salmon. If it is a consistent pink color through and there is white seeping out the top, it is finished. \r\n\r\nWhen done, serve with vinaigrette or lemon and garnish with additional dill or cilantro.",
        "created_at": "2019-07-04T16:24:48.337Z",
        "updated_at": "2019-07-04T16:24:48.337Z",
        "url": "http://localhost:3000/recipes/5d1e28500765e00c41a47e10.json"
    },
    {
        "id": {
            "$oid": "5d1e286c0765e00c41a47e11"
        },
        "title": "Carbonara",
        "source": "Antonio Carluccio",
        "genre": "meat",
        "ingredients": [
            "½ lb (220g) spaghetti or spaghettoni (the thicc spaghetti)",
            "¼ lb guanciale (the cheek of the pork) or pancetta, cut into small cubes",
            "2 tbsp olive oil",
            "2 eggs and 1 yolk",
            "50g parmesan cheese (or aged pecorino), freshly grated",
            "freshly ground black pepper"
        ],
        "instructions": "Cook the pasta in a large pan of boiling salted water until al dente.\r\n\r\nMeanwhile, heat the oil in a pan and fry the guanciale or pancetta until crisp. Lightly beat the eggs in a large bowl with the grated cheese and pepper. When the pasta is ready, drain and add to the pan with the guanciale or pancetta. Then mix well to coat everything. Take off the heat. Allow to cool slightly, so as not to scramble the eggs. Then add the egg and cheese mixture. Stir to coat the pasta and serve immediately.\r\n\r\nGarnish with grated parmesan and freshly ground black pepper.",
        "created_at": "2019-07-04T16:25:16.785Z",
        "updated_at": "2019-07-04T16:25:16.785Z",
        "url": "http://localhost:3000/recipes/5d1e286c0765e00c41a47e11.json"
    },
    {
        "id": {
            "$oid": "5d1e28980765e00c41a47e12"
        },
        "title": "Shepherd’s Pie",
        "source": "Peter Boyd",
        "genre": "meat",
        "ingredients": [
            "2 tbsp olive oil",
            "2 lbs ground lamb",
            "4 tbsp soy sauce",
            "4 tbsp worchester sauce",
            "1 large onion finely chopped",
            "1 tsp Hoisin sauce",
            "1 tsp garlic chili paste",
            "peas and carrots (optional)",
            "3 oz tomato paste",
            "1 tbsp garam marsala",
            "2 tbsp oregano",
            "parmesan",
            "potatoes ",
            "butter",
            "cream (optional)"
        ],
        "instructions": "Preheat oven to 350°.\r\n\r\nFry meat in olive oil until brown. Add soy and worcester sauce. Add onions, Hoisin sauce, garlic chili paste. Optionally, add in peas and carrots. When onions are fully cooked, add tomato paste. Mix well, turn off heat. Finally, stir in garam marsala.\r\n\r\nBoil potatoes until soft. Then blend until very smooth with a generous pad of butter and cream.\r\n\r\nCover bottom of pan with oregano. Spoon in meat. Then spoon in mashed potatoes. Spread out and rake with fork into decorative pattern. Grate parmesan on top, then spray or brush top generously with olive oil. Bake for 30 mins. Then brown under the grill. Watch carefully, as it will brown very quickly!",
        "created_at": "2019-07-04T16:26:00.487Z",
        "updated_at": "2019-07-04T16:26:18.193Z",
        "url": "http://localhost:3000/recipes/5d1e28980765e00c41a47e12.json"
    },
    {
        "id": {
            "$oid": "5d1e28c70765e00c41a47e13"
        },
        "title": "Marinated Kale",
        "source": "Nike Lawrence",
        "genre": "veggie",
        "ingredients": [
            "1.5 bags Tuscan Kale (smooth leaf; trader joes)",
            "½ cup olive oil",
            "⅛ cup apple cider vinegar",
            "⅛ Braggs amino acids",
            "1 tbsp fresh lemon juice",
            "1.5 tbsp grated parmesan",
            "garlic powder"
        ],
        "instructions": "Mix all ingredients other than the kale together.\r\n\r\nCoat kale in sauce in a large bowl. Marinate in fridge for 24 hours. Eat!",
        "created_at": "2019-07-04T16:26:47.579Z",
        "updated_at": "2019-07-04T16:26:47.579Z",
        "url": "http://localhost:3000/recipes/5d1e28c70765e00c41a47e13.json"
    },
    {
        "id": {
            "$oid": "5d1e28e10765e00c41a47e14"
        },
        "title": "Grilled Tempeh & Arugula Salad",
        "source": "Kush Patel",
        "genre": "veggie",
        "ingredients": [
            "1 lb baby arugula",
            "6 oz tempeh",
            "cherry tomatoes",
            "crumbly blue cheese",
            "glazed pecans (see Nuts section)",
            "dried cranberries",
            "soy sauce",
            "olive oil",
            "balsamic vinegar",
            "salt ",
            "pepper"
        ],
        "instructions": "Slice tempeh thinly and sautée in olive oil. Pour a bit of soy sauce over the tempeh while cooking, and cook both sides until browned.\r\n\r\nCombine arugula, tempeh, tomatoes (sliced in half), pecans, cranberries, and cheese crumbles in a large salad bowl. Dress with 50/50 mix of oil and vinegar and add salt and pepper to taste.",
        "created_at": "2019-07-04T16:27:13.873Z",
        "updated_at": "2019-07-04T16:27:13.873Z",
        "url": "http://localhost:3000/recipes/5d1e28e10765e00c41a47e14.json"
    },
    {
        "id": {
            "$oid": "5d1e29060765e00c41a47e15"
        },
        "title": "Spinach & Persimmon Salad",
        "source": "Chris Reed",
        "genre": "veggie",
        "ingredients": [
            "1 lb fresh baby spinach (washed and dried)",
            "4 Fuyu persimmons (ripe - firm to soft but not hard)",
            "⅛ cup rice vinegar",
            "2 tbsp marmalade",
            "2 tbsp sesame oil",
            "salt ",
            "fresh ground pepper",
            "2 cups glazed pecans"
        ],
        "instructions": "Peel the persimmons (a bit tricky, use a sharp potato peeler or a sharp paring knife) and slice into thin wedges. \r\n\r\nIn a large salad bowl, mix the vinegar, marmalade, and sesame oil with a whisk. Add salt and pepper to taste. Add the spinach, persimmons and glazed pecans. Toss well.",
        "created_at": "2019-07-04T16:27:50.558Z",
        "updated_at": "2019-07-04T16:27:50.558Z",
        "url": "http://localhost:3000/recipes/5d1e29060765e00c41a47e15.json"
    },
    {
        "id": {
            "$oid": "5d1e29280765e00c41a47e16"
        },
        "title": "Bitter Greens & Poached Pear Salad",
        "source": "Chris Reed",
        "genre": "veggie",
        "ingredients": [
            "variety of bitter greens (and reds): frisee, spinach, arugula, baby arugula etc.",
            "radicchio",
            "endive (several)",
            "Humboldt Fog goat cheese – crumbled. Use plenty.",
            "mildly oven-browned pistachios or glazed pecans (see Nuts section)",
            "poached ripe pears (in brown sugar, cloves, nutmeg) OR dried pears soaked for several hours in port.",
            "lemon juice"
        ],
        "instructions": "In a salad bowl, mix the greens and reds in bite-size pieces. Toss with lemon juice. Add goat\r\ncheese, nuts and pears. Serve immediately.\r\n\r\nPoached pears:\r\nMake a syrup of brown sugar and water with a few cloves and nutmeg added. Simmer peeled ripe pears for 20 mins, remove from the syrup and allow to dry.",
        "created_at": "2019-07-04T16:28:24.283Z",
        "updated_at": "2019-07-04T16:28:24.283Z",
        "url": "http://localhost:3000/recipes/5d1e29280765e00c41a47e16.json"
    },
    {
        "id": {
            "$oid": "5d1e29560765e00c41a47e17"
        },
        "title": "Salsa Verde Fresca",
        "source": "Devin Reed",
        "genre": "sauce",
        "ingredients": [
            "6 fresh tomatillos",
            "5 serrano chiles",
            "2 habanero chiles",
            "4 cloves fresh garlic",
            "½ lime",
            "kosher salt",
            "fresh ground black pepper"
        ],
        "instructions": "Pulse tomatillos in blender until liquid. Add chiles, garlic, and lime. Blend. Add salt and pepper to taste. Easy.\r\n\r\nInspired by Manny Perez.",
        "created_at": "2019-07-04T16:29:10.495Z",
        "updated_at": "2019-07-04T16:29:10.495Z",
        "url": "http://localhost:3000/recipes/5d1e29560765e00c41a47e17.json"
    },
    {
        "id": {
            "$oid": "5d1e29980765e00c41a47e18"
        },
        "title": "Roasted Tomato Salsa",
        "source": "Devin Reed",
        "genre": "sauce",
        "ingredients": [
            "1 head garlic",
            "½ yellow or white onion",
            "6 fresh Roma tomatoes",
            "5 serrano chiles",
            "1 habanero chile",
            "1 lime"
        ],
        "instructions": "Cut the tip off the head of garlic to expose the cloves. Peel and cut the onion into quarters. Cut off inedible bits of chiles and tomatoes. Place all ingredients, except lime, under the broiler until blackened.\r\n\r\nPut all blackened ingredients in a blender, except the garlic. For the garlic head, squeeze out the cloves into the blender, avoiding getting the inedible papery skin in. Squeeze the lime in the blender and blend until saucy. Enjoy.\r\n\r\nFor chilaquiles, simply saute crispy tortilla chips in this sauce for a few minutes and top with queso fresco.\r\n\r\nInspired by Manny Perez.",
        "created_at": "2019-07-04T16:30:16.426Z",
        "updated_at": "2019-07-04T16:30:16.426Z",
        "url": "http://localhost:3000/recipes/5d1e29980765e00c41a47e18.json"
    },
    {
        "id": {
            "$oid": "5d1e29bd0765e00c41a47e19"
        },
        "title": "Fermented Garlic Chili Paste",
        "source": "Brothers Green",
        "genre": "sauce",
        "ingredients": [
            "a bunch of red fresno or jalapeño peppers",
            "some garlic",
            "some ginger",
            "a fair bit of salt",
            "a little sugar"
        ],
        "instructions": "Pureé all ingredients. Place in jar at room temperature and stir once a day. After a few days it will begin to ferment. Enjoy after 5-15 days, depending on desired funkiness.",
        "created_at": "2019-07-04T16:30:53.216Z",
        "updated_at": "2019-07-04T16:30:53.216Z",
        "url": "http://localhost:3000/recipes/5d1e29bd0765e00c41a47e19.json"
    },
    {
        "id": {
            "$oid": "5d1e29d60765e00c41a47e1a"
        },
        "title": "Cranberry Sauce",
        "source": "Joy of Cooking",
        "genre": "sauce",
        "ingredients": [
            "1 lb cranberries",
            "1¼ cups sugar",
            "½ cup water",
            "½ cup orange juice",
            "2 tsp grated orange zest (about 1 orange) "
        ],
        "instructions": "Cook, uncovered until the cranberries pop open and the mixture is thickened, about 7-15 minutes.\r\n\r\nLet cool and serve warm, or refrigerate and enjoy cold.",
        "created_at": "2019-07-04T16:31:18.763Z",
        "updated_at": "2019-07-04T16:31:18.763Z",
        "url": "http://localhost:3000/recipes/5d1e29d60765e00c41a47e1a.json"
    },
    {
        "id": {
            "$oid": "5d1e29ef0765e00c41a47e1b"
        },
        "title": "Tomato Sauce",
        "source": "Basics with Babish",
        "genre": "sauce",
        "ingredients": [
            "3 tbsp olive oil",
            "½ onion, finely chopped",
            "5-6 cloves garlic, minced",
            "2 tbsp tomato paste (optional)",
            "red pepper flakes",
            "dried oregano",
            "2 can San Marazano tomatoes",
            "sprig of fresh basil and/or thyme",
            "a generous pad of butter",
            "kosher salt",
            "fresh ground pepper"
        ],
        "instructions": "Bring olive oil to a shimmer in a hot pan. Stir in the onion and cook on medium heat until it loses most of its moisture and begins to carmelize. Add garlic and simmer for a minute or two until it becomes fragrant.. Add the red pepper flakes and oregano and let the flavors mingle for thirty seconds or so. \r\n\r\nOptionally, stir in tomato paste.\r\n\r\nAdd the tomatoes and stir it in, breaking up the tomatoes. Then stir in the basil or thyme sprig. Let simmer on low heat, partially covered, for at least an hour.\r\n\r\nRemove the spent herbs and add butter, to deepen flavor. Finally, season with salt and pepper to taste. Use on pasta or pizza.",
        "created_at": "2019-07-04T16:31:43.773Z",
        "updated_at": "2019-07-04T16:31:43.773Z",
        "url": "http://localhost:3000/recipes/5d1e29ef0765e00c41a47e1b.json"
    },
    {
        "id": {
            "$oid": "5d1e2a130765e00c41a47e1c"
        },
        "title": "Vegan Ranch Sauce",
        "source": "Kush Patel",
        "genre": "sauce",
        "ingredients": [
            "Vegenaise",
            "apple cider vinegar",
            "Worcestershire sauce",
            "onion powder",
            "garlic powder",
            "paprika",
            "salt",
            "pepper",
            "fresh dill (optional)"
        ],
        "instructions": "All ingredients should be added to taste and desired quantity.\r\n\r\nMix up Vegenaise with Worcestershire sauce to taste. Then add apple cider vinegar until slightly runny consistency is achieved. Then mix in onion powder, garlic powder, paprika, and optionally fresh dill for taste. Finally season with salt and pepper and serve with vegan chicken wings or buffalo pizza.",
        "created_at": "2019-07-04T16:32:19.063Z",
        "updated_at": "2019-07-04T16:32:19.063Z",
        "url": "http://localhost:3000/recipes/5d1e2a130765e00c41a47e1c.json"
    },
    {
        "id": {
            "$oid": "5d1e2a330765e00c41a47e1d"
        },
        "title": "Glazed Pecans",
        "source": "Chris Reed",
        "genre": "baked",
        "ingredients": [
            "2 cups whole pecans",
            "⅓ cup sugar",
            "¼ cup water",
            "1 tbsp butter",
            "2 tsp ground cumin",
            "¼ tsp ground cayenne pepper",
            "½ tsp ground fennel"
        ],
        "instructions": "Bake pecans on a thin cookie sheet at moderate temp (350 F) until slightly puffed and slightly browned. Take care not to burn them. This can happen quite quickly. Set aside to cool.\r\n\r\nHeat sugar, water, and butter in saucepan until frothy. Add spices and boil a few minutes to evaporate some water.\r\n\r\nAdd the cooled pecans to the syrup, mix to coat them thoroughly, and spread the glazed pecans onto aluminum foil to dry (30-60 mins). Separate them into individual pieces so they dry well and don’t clump together. You may want to move them around a bit as they dry so they don’t stick strongly to the foil.",
        "created_at": "2019-07-04T16:32:51.171Z",
        "updated_at": "2019-07-04T16:32:51.171Z",
        "url": "http://localhost:3000/recipes/5d1e2a330765e00c41a47e1d.json"
    },
    {
        "id": {
            "$oid": "5d1e2a540765e00c41a47e1e"
        },
        "title": "Candied Pecans",
        "source": "Kush Patel",
        "genre": "baked",
        "ingredients": [
            "1 lb pecans",
            "1 egg white",
            "1 tbsp water",
            "1 cup sugar",
            "1 tsp salt",
            "1 tsp cinnamon"
        ],
        "instructions": "Beat egg white with water until stiff peaks. \r\n\r\nAdd pecans and mix to coat evenly.\r\n\r\nAdd remaining ingredients and mix again.\r\n\r\nBake for 55 minutes to 1 hour at 250˚F, mixing every 15 minutes.",
        "created_at": "2019-07-04T16:33:24.762Z",
        "updated_at": "2019-07-04T16:33:24.762Z",
        "url": "http://localhost:3000/recipes/5d1e2a540765e00c41a47e1e.json"
    },
    {
        "id": {
            "$oid": "5d1e2a840765e00c41a47e1f"
        },
        "title": "Classic British Scones",
        "source": "Mischa Lewis-Norelle",
        "genre": "",
        "ingredients": [
            "285 g (2 cups) flour",
            "40 g (3 tbsp) sugar",
            "1 tbsp baking powder",
            "½ tsp salt",
            "70 g (5 tbsp) cold unsalted butter",
            "120 g (1 cup) heavy cream (or buttermilk or coconut milk)",
            "½ cup dried currants or cranberries (optional)"
        ],
        "instructions": "Preheat oven to 425˚F. \r\n\r\nCombine dry ingredients and butter with food processor or fingertips until mixture resembles coarse sand. Stir in any mix-ins. Then put the mixture in the freezer for 15 minutes, or overnight for easy scones tomorrow morning.\r\n\r\nStir in cream until a dough begins to form. Then transfer to a floured work surface and knead together until the dough just comes together in a rough, slightly sticky ball. Gently pat dough into a ¾-inch-think circle, and cut into 8 wedges. Bake until tops are light brown, 12-15 minutes. Let cool on rack for 10 minutes before serving with butter (or clotted cream if available) and jam.\r\n\r\nVariations:\r\nJalapeno Cheddar: omit sugar. Add only 3 tbsp butter along with 4 oz sharp cheddar cheese. Add ½ cup jalapenos.\r\nCranberry Orange: add ½ cup cranberries, the zest of an orange, and 2 tbsp orange liqueur\r\nGinger, Lemon, Mint: add ½ cup crystallized ginger, the zest of a lemon, 2 tbsp lemon juice or extract, ¼ cup chopped mint",
        "created_at": "2019-07-04T16:34:12.563Z",
        "updated_at": "2019-07-04T16:34:12.563Z",
        "url": "http://localhost:3000/recipes/5d1e2a840765e00c41a47e1f.json"
    },
    {
        "id": {
            "$oid": "5d1e2a9f0765e00c41a47e20"
        },
        "title": "Deadly Heavy Flapjacks",
        "source": "Kitchen Mason",
        "genre": "baked",
        "ingredients": [
            "125g butter",
            "125g brown sugar",
            "4 tbsp maple syrup",
            "225g old fashioned oats",
            "75g pecans, roughly chopped"
        ],
        "instructions": "Preheat oven to 200˚ C / 400˚ F.\r\n\r\nGrease an 8x8 baking tray and line with baking paper.\r\n\r\nMelt butter, sugar, and maple syrup over medium heat in a saucepan. When melted and combined, kill the heat and add pecans and oats. Mix well.\r\n\r\nPour mixture into baking tray and smooth out top. Bake for 15 mins, let cool. Then cut into squares",
        "created_at": "2019-07-04T16:34:39.142Z",
        "updated_at": "2019-07-04T16:34:43.123Z",
        "url": "http://localhost:3000/recipes/5d1e2a9f0765e00c41a47e20.json"
    },
    {
        "id": {
            "$oid": "5d1e2abf0765e00c41a47e21"
        },
        "title": "Granola",
        "source": "Kush Patel",
        "genre": "baked",
        "ingredients": [
            "3 cups dry oats",
            "½ cup olive oil",
            "½ cup maple syrup",
            "½ tsp cinnamon",
            "½ tsp salt",
            "1 cup chopped pecans",
            "1 cup dried cranberries"
        ],
        "instructions": "Preheat oven to 300˚F. Mix oats, oil, maple syrup, cinnamon, and salt in a bowl. Spread out on a baking sheet and bake high in the oven for 10-15 minutes.\r\n\r\nMeanwhile, chop a cup of pecans. Take the oats out and mix in the pecans. Return to the oven for another 10 minutes.\r\n\r\nRemove from oven, let cool, and mix in cranberries.",
        "created_at": "2019-07-04T16:35:11.293Z",
        "updated_at": "2019-07-04T16:35:11.293Z",
        "url": "http://localhost:3000/recipes/5d1e2abf0765e00c41a47e21.json"
    },
    {
        "id": {
            "$oid": "5d1e2adf0765e00c41a47e22"
        },
        "title": "Lava Cakes of Love",
        "source": "Matty Matheson",
        "genre": "baked",
        "ingredients": [
            "115g (¼ lb) butter",
            "115g (4 oz) semisweet baking chocolate",
            "2 eggs",
            "3 egg yolks",
            "1 tsp vanilla",
            "60g icing sugar (granulated also works)",
            "40g flour",
            "1 tbsp espresso powder (optional)",
            "sea salt"
        ],
        "instructions": "Preheat oven to 425˚ F. Grease four ramekins or porcelain mugs with butter.\r\n\r\nOver a double boiler, melt and combine butter and chocolate. Remove from heat and incorporate eggs and yolks quickly. Then stir in vanilla, sugar, and flour, and, optionally, espresso powder (for added flavor).\r\n\r\nFill ramekins equally and sprinkle top with sea salt. Bake for 12 minutes. Let cool serve with whipped cream and raspberries.",
        "created_at": "2019-07-04T16:35:43.818Z",
        "updated_at": "2019-07-04T16:35:43.818Z",
        "url": "http://localhost:3000/recipes/5d1e2adf0765e00c41a47e22.json"
    },
    {
        "id": {
            "$oid": "5d1e2b060765e00c41a47e23"
        },
        "title": "Jam Doughnuts",
        "source": "Paul Hollywood",
        "genre": "baked",
        "ingredients": [
            "500g strong flour",
            "50g caster sugar",
            "40g softened butter",
            "10g salt",
            "14g yeast",
            "130ml water",
            "2 eggs",
            "150ml whole milk",
            "raspberries",
            "sugar",
            "lemon juice",
            "Jam"
        ],
        "instructions": "Combine raspberries, sugar, and lemon juice in pot. Simmer for ten to fifteen minutes, until desired consistency. Allow to cool completely in the fridge.\r\n\r\nCombine flour, sugar, butter, salt, yeast, water, and eggs. Slowly add milk to make a very wet dough. Coat work surface and hands with flour. Coat dough with a little flour and knead forcefully with hands for about 10 minutes until it gets smooth and less sticky. Proof in cling film covered bowl for about an hour. \r\n\r\nRoll out onto floured surface, coat with flour. Roll out long, divide, and roll into 10 balls. Cover and leave to proof until they double in size and spring back with a finger press.\r\n\r\nDeep fry in batches at 160˚C for about 5 minutes each side, until they reach a golden brown. Roll in sugar and cool on wire rack. Make a hold into the center of each doughnut with a knife and twist. Inject each with jam as possible.",
        "created_at": "2019-07-04T16:36:22.347Z",
        "updated_at": "2019-07-04T16:36:22.347Z",
        "url": "http://localhost:3000/recipes/5d1e2b060765e00c41a47e23.json"
    },
    {
        "id": {
            "$oid": "5d1e2b250765e00c41a47e24"
        },
        "title": "Strawberry Rhubarb Pie",
        "source": "Chris Reed",
        "genre": "baked",
        "ingredients": [
            "3 cups chopped rhubarb",
            "1 cup chopped strawberries",
            "1 1/3 cups white sugar",
            "6 tablespoons all-purpose flour",
            "1 tablespoon butter, diced",
            "2 9-inch pie pastry rolls"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C)\r\nRoll out pastry (at room temp)\r\nCombine sugar and flour in bowl and mix well. Sprinkle ¼ of it over pastry in pie plate.\r\nHeap fruit over this mixture. Sprinkle with remaining sugar and flour.\r\nDot with small pieces of chopped butter. Cover with top crust. Seal with fork, trim and poke breathing slots.\r\nPaint with beaten egg for glaze.\r\nPlace pie on lowest rack in oven. Bake for 15 minutes. Reduce oven temperature to 350\r\ndegrees F (175 degrees C), and continue baking for 40 to 45 minutes.\r\nAllow 25 mins to cool.\r\nServe warm or cold with vanilla ice cream.",
        "created_at": "2019-07-04T16:36:53.904Z",
        "updated_at": "2019-07-04T16:36:53.904Z",
        "url": "http://localhost:3000/recipes/5d1e2b250765e00c41a47e24.json"
    },
    {
        "id": {
            "$oid": "5d1e2b5a0765e00c41a47e25"
        },
        "title": "Shortbread Crust",
        "source": "Diana Moles",
        "genre": "baked",
        "ingredients": [
            "1 ½ sticks (12 tablespoons) cold unsalted butter",
            "½ cup confectioners’ sugar",
            "½ teaspoon salt",
            "¼ teaspoon vanilla extract",
            "1 ½ cups all-purpose flour"
        ],
        "instructions": "Cream butter and sugar. Mix in other ingredients and chill, 1-2 hours. Then roll into 9-inch circle using springform pan base, prick with fork all over. Bake in pan at 350˚F for 12-15 minutes. Let cool completely.",
        "created_at": "2019-07-04T16:37:46.878Z",
        "updated_at": "2019-07-04T16:37:46.878Z",
        "url": "http://localhost:3000/recipes/5d1e2b5a0765e00c41a47e25.json"
    },
    {
        "id": {
            "$oid": "5d1e2b8e0765e00c41a47e26"
        },
        "title": "Chicago-Style Cheesecake",
        "source": "Diana Moles",
        "genre": "baked",
        "ingredients": [
            "shortbread crust",
            "2 lbs (32 oz) cream cheese",
            "1 cup granulated sugar",
            "¼ cup cake flour",
            "¼ teaspoon salt",
            "2 large whole eggs",
            "1 large egg yolk",
            "1 teaspoon vanilla extract",
            "¾ cup sour cream"
        ],
        "instructions": "Beat cream cheese until light and fluffy. Scrape down sides of bowl. In a separate mixing bowl, combine sugar, flour, and salt. Add to cream and beat until creamy and smooth. Slowly beat in whole eggs, then yolk, then sour cream and vanilla. Take time between ingredients to make sure mixture is fully blended and fluffy.\r\n\r\nBrush the sides of the springform pan with mixture of 3 tbsp veg oil and 2 tbsp flour. Pour in batter and bake for 40 minutes at 375˚F, until lightly browned. Rotate cake halfway through to ensure even browning.\r\n\r\nReduce oven temp and leave ajar, then turn off oven, letting cake cool slowly to prevent cracking. Once room temp, refrigerate 8 hours before serving with raspberry coulis. ",
        "created_at": "2019-07-04T16:38:38.246Z",
        "updated_at": "2019-07-04T16:38:38.246Z",
        "url": "http://localhost:3000/recipes/5d1e2b8e0765e00c41a47e26.json"
    },
    {
        "id": {
            "$oid": "5d1e2bbf0765e00c41a47e27"
        },
        "title": "Pavlova",
        "source": "Herbert Sachse, via Chris Reed",
        "genre": "baked",
        "ingredients": [
            "4-6 egg whites (no yolk!)",
            "pinch salt",
            "5-6 oz confectioner’s sugar",
            "1 tsp white vinegar",
            "½ tsp vanilla essence",
            "2 tsp cornflour"
        ],
        "instructions": "Preheat oven to 400˚F (200˚C). Lightly grease oven tray.\r\n\r\nBeat the whites of eggs with a pinch of salt until stiff peaks form. Continue beating, gradually adding sugar, vinegar, and vanilla, until of think consistency.\r\n\r\nLightly fold in cornflour, without losing any of the air. Then pile mixture into a circular shape, with a slight indent in the center, so it holds the toppings.\r\n\r\nBake at 400˚F for five or ten minutes (depending on the oven), then reduce temperature to 250˚F (130˚C) and bake for another hour. Turn oven off and leave pavlova in oven until cool.\r\n\r\nTop with whipped cream or creme fraiche and passion fruit or raspberry coulis.",
        "created_at": "2019-07-04T16:39:27.033Z",
        "updated_at": "2019-07-04T16:39:27.033Z",
        "url": "http://localhost:3000/recipes/5d1e2bbf0765e00c41a47e27.json"
    },
    {
        "id": {
            "$oid": "5d1e2be20765e00c41a47e28"
        },
        "title": "Brown Butter Chocolate Chip Cookies",
        "source": "Basics with Babish",
        "genre": "baked",
        "ingredients": [
            "1 cup unsalted butter",
            "1 cup white sugar",
            "1½ cup brown sugar",
            "2 cold eggs",
            "11½ oz all-purpose flour",
            "1 tbsp kosher salt ",
            "½ tsp baking soda",
            "¾ tsp cinnamon (optional)",
            "chopped-up baking chocolate",
            "toasted pecans"
        ],
        "instructions": "Brown the butter by melting in a saucepan over medium heat until the milkfat separates and begins to turn a light brown. Refrigerate until it resolidifies.\r\n\r\nCream together butter and sugar. Crack eggs into bowl and combine.\r\n\r\nSeparately, combine flour, salt, baking soda, and, optionally, cinnamon. Mix in one half at a time into butter and sugar mixture until just combined. Then add mix-ins. Refrigerate for one hour to three days. Having everything cold will provide better texture for the cookies. Letting ingredients sit for a few days will improve the flavor.\r\n\r\nPreheat oven to 350˚F and get out an ungreased baking tray. For each cookie, roll a generous amount of dough into a ball and then tear it open, exposing lots of great nooks & crannies. Bake for 12-17 minutes depending on preferred gooeyness and size.\r\n\r\nIf the cookies aren’t already too salty, top with some flaky sea salt and serve.",
        "created_at": "2019-07-04T16:40:02.436Z",
        "updated_at": "2019-07-04T16:40:02.436Z",
        "url": "http://localhost:3000/recipes/5d1e2be20765e00c41a47e28.json"
    },
    {
        "id": {
            "$oid": "5d1e2c000765e00c41a47e29"
        },
        "title": "Chocolate Crinkle Cookies",
        "source": "King Arthur Flour, via Begonia Bacioguadalupe",
        "genre": "baked",
        "ingredients": [
            "8 oz chopped baking chocolate",
            "4 oz unsalted butter",
            "135 g granulated sugar",
            "3 large eggs",
            "2 tsp vanilla extract",
            "2 tsp espresso powder (optional)",
            "½ tsp baking powder",
            "¼ tsp salt",
            "200g cup all-purpose flour",
            "confectioner’s sugar, for coating"
        ],
        "instructions": "Melt the butter and chocolate together in a small saucepan.\r\n\r\nIn a separate bowl, beat together sugar, eggs, vanilla, and espresso powder. Stir in the chocolate mixture (make sure it isn’t too hot so you don’t cook the eggs!), baking powder, and salt, then finally the flour. Chill for 2 to 3 hours.\r\n\r\nPreheat oven to 325˚F. Lightly grease a couple of baking sheets.\r\n\r\nMake teaspoon-sized balls of dough, tossing them five or six at a time in confectioner’s sugar. Place them on the prepared baking sheets and cook for 10 to 12 minutes.",
        "created_at": "2019-07-04T16:40:32.046Z",
        "updated_at": "2019-07-04T16:40:32.046Z",
        "url": "http://localhost:3000/recipes/5d1e2c000765e00c41a47e29.json"
    }

]
